DataProcessors/WEB_WORKSTATION_2_0.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<DataProcessor>		<InternalInfo>			<xr:GeneratedType name="DataProcessorObject.WEB_WORKSTATION_2_0" category="Object">				<xr:TypeId>db5fe0d4-d452-4610-b97a-7d6c518f03cf</xr:TypeId>				<xr:ValueId>b990f2fb-05df-4372-95d7-a9b8b8a99a7e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DataProcessorManager.WEB_WORKSTATION_2_0" category="Manager">				<xr:TypeId>dd82bc2e-9ea0-4506-8a4e-455fd7690432</xr:TypeId>				<xr:ValueId>6d3e07dc-c0c9-4c4a-8c19-228dbe699a3d</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>WEB_WORKSTATION_2_0</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Web Workstation 2 0</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects/>	</DataProcessor></MetaDataObject>

InformationRegisters/ТекущийЗаказНаСтанции.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ТекущийЗаказНаСтанции" category="Record">				<xr:TypeId>6c6257cf-7e08-42f5-b27f-24e1194c8806</xr:TypeId>				<xr:ValueId>dab09a1c-81da-4ee5-9d2a-4b8c70bd3f34</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ТекущийЗаказНаСтанции" category="Manager">				<xr:TypeId>258fdaa4-6c08-4980-bcaf-8bb15e4ee386</xr:TypeId>				<xr:ValueId>208a994e-e017-430d-9fe9-faecbc1efbdf</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ТекущийЗаказНаСтанции" category="Selection">				<xr:TypeId>1bb97572-1d83-487c-9663-851d919cdc98</xr:TypeId>				<xr:ValueId>d8b48826-9682-429e-838f-f5a3aaba9b2c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ТекущийЗаказНаСтанции" category="List">				<xr:TypeId>0f59dbe7-e98a-4c74-9152-5ff0ebf78c21</xr:TypeId>				<xr:ValueId>5db5caf7-0725-4b4e-848d-821e3d49efc7</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ТекущийЗаказНаСтанции" category="RecordSet">				<xr:TypeId>395ad085-b8e5-4c9a-8b53-b5c6ef349622</xr:TypeId>				<xr:ValueId>f2ff7753-dcdd-42f5-9b94-53821f6827b0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ТекущийЗаказНаСтанции" category="RecordKey">				<xr:TypeId>82d75e65-00e4-4400-b188-a9379ad92674</xr:TypeId>				<xr:ValueId>bac28adf-f150-4c7b-932f-369ed994b583</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ТекущийЗаказНаСтанции" category="RecordManager">				<xr:TypeId>2c89902b-fb41-4ab2-872a-495492813eff</xr:TypeId>				<xr:ValueId>c5c76f3c-0a86-4de7-911b-16c554af6ba8</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ТекущийЗаказНаСтанции</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Текущий заказ на станции</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>ОтсканированПолностью</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Отсканирован полностью</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:boolean</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Attribute>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>РабочееМестоОператора</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Рабочее место оператора</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.РабочиеМестаОператоров</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

Enums/ОперацииКачества.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Enum>		<InternalInfo>			<xr:GeneratedType name="EnumRef.ОперацииКачества" category="Ref">				<xr:TypeId>59f6e2b3-3fe3-4dea-9e9e-20b0a903885d</xr:TypeId>				<xr:ValueId>2e3ccf96-8d7f-4b0b-b5a1-6640743d1d2d</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumManager.ОперацииКачества" category="Manager">				<xr:TypeId>8d6a7e33-c6e2-492c-96a2-2d2745a01dab</xr:TypeId>				<xr:ValueId>7f79ee6b-6ee9-428e-83c1-378fccce7a79</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumList.ОперацииКачества" category="List">				<xr:TypeId>412936e4-068f-45d0-b8de-774818fbce74</xr:TypeId>				<xr:ValueId>a1c86ba4-a639-4f8d-8b25-60260d3ee912</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ОперацииКачества</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Операции качества</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Quality operations</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>false</UseStandardCommands>			<StandardAttributes>				<xr:StandardAttribute name="Order">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Ref">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<Characteristics/>			<QuickChoice>true</QuickChoice>			<ChoiceMode>BothWays</ChoiceMode>			<DefaultListForm/>			<DefaultChoiceForm/>			<AuxiliaryListForm/>			<AuxiliaryChoiceForm/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>		</Properties>		<ChildObjects>			<EnumValue>				<Properties>					<Name>Проверка</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Проверка</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Check</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>Ремонт</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ремонт</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Repair</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>Контроль</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Контроль</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>		</ChildObjects>	</Enum></MetaDataObject>

DataProcessors/WEB_WORKSTATION_2_0/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьСтатусЗаказа(Запрос, Ответ) Экспорт
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("РабочееМесто", РабочееМесто);
	
	Заказ = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("Заказ", Заказ);
	
	ДанныеЗапроса = Запрос.Тело;
	Если Запрос.Тело = Неопределено Тогда
		ТекстОтвета = "Не удалось получить данные для регистрации статуса заказа.";
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ТекстОтвета);
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));
		
		Отказ = Ложь;
		
		ДанныеОперации = ДанныеЭлемента(ДанныеЗапроса, РабочееМесто);
		
		// Проверка на заполненность реквизита ОтветственныйЗаДефект в теле запроса при открытии консерна (status = "открыт").
		// Ранее выполнялось автоопределение ответственного за дефект, если он не передан в запросе.
		// С 09.02.2023 г. пустое значение реквизита ОтветственныйЗаДефект при статусе в теле запроса "открыт" - считается ошибкой.
		Если НРег(ДанныеЗапроса.status) = "открыт" И НЕ ЗначениеЗаполнено(ДанныеОперации.ОтветственныйЗаДефект) Тогда
			Результат.errorMessage = "Поле ""Ответственный за дефект"" не заполнено.";
			Результат.isError = Истина;
			
			Отказ = Истина;
		КонецЕсли;
		
		// Проверка инспектируемого элемента на применимость к заказу по формуле применимости.
		// Если формула не выполняется, документ не создаем и возвращаем ошибку.
		ФормулаПрименимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОперации.ИнспектируемыйЭлемент, "ФормулаПрименимости");
		
		Если ЗначениеЗаполнено(ФормулаПрименимости)
				И НЕ Справочники.ИнспектируемыеЭлементы.ВычислитьФормулуПрименимости(ФормулаПрименимости, Запрос.ДополнительныеСвойства.Заказ) Тогда
			
			Результат.errorMessage = "Инспектируемый элемент неприменим к заказу по формуле применимости.";
			Результат.isError = Истина;
			
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ТекстОтвета = "";
			ДокументСоздан = РегистрацияКонсерна(ДанныеОперации, Заказ, ТекстОтвета);
			
			РегистрыСведений.ТекущийЗаказНаСтанции.СохранитьСостояниеЗаказа(РабочееМесто,Заказ,Ложь);
			
			Если ДокументСоздан = Истина Тогда
				Результат.errorMessage = "Документ создан";
				Результат.isError = Ложь;
			Иначе
				Результат.errorMessage = ТекстОтвета;
				Результат.isError = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Ответ.Данные = Результат;
	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗавершитьИнспекциюЗаказа(Запрос, Ответ) Экспорт 
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("РабочееМесто", РабочееМесто);
	
	Заказ = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("Заказ", Заказ);
	
	Попытка
		
		ДанныеОперации = ДанныеДляЗавершенияИнспекции(РабочееМесто, Заказ);
		Если ДанныеОперации = Неопределено Тогда
			ТекстОтвета = "Не удалось собрать все данные для завершения инспекции.";
			РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ТекстОтвета, 500);
			Возврат;	
		КонецЕсли;	

		ТекстСообщения = "";
		
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));

		ЭтоОшибка = Не СоздатьДокументРегистрацияПрохожденияТочекПроверкиКачества(ДанныеОперации, ТекстСообщения);	

		Если Не ЭтоОшибка Тогда
			РегистрыСведений.ТекущийЗаказНаСтанции.СохранитьСостояниеЗаказа(РабочееМесто,Заказ,Истина);
        КонецЕсли;
				
		Результат.errorMessage = ТекстСообщения;
		Результат.isError = ЭтоОшибка;
		
		Ответ.Данные = Результат;
	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьРемонт(Запрос, Ответ) Экспорт 
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("РабочееМесто", РабочееМесто);  
	Заказ = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("Заказ", Заказ);
	
	ТочкаПроверкиКачества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "ТочкаПроверкиКачества");
	
	П = Новый Структура("documentDefectGUID,documentDefectComment,documentDefectReplace,documentDefectRemove,documentDefectRepairTime");
	ЗаполнитьЗначенияСвойств(П,Запрос.Тело);

	Попытка
		
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));
		
		//Должен быть Заказ
		//Должен быть Консерн
	
		//Создание 	       
		СообщениеОбОшибке = "";
		ДокументСоздан = QNS.РегистрацияРемонта(ТочкаПроверкиКачества,
			П.documentDefectGUID,
			П.documentDefectComment, 
			П.documentDefectReplace, 
			П.documentDefectRemove, 
			"", 
			СообщениеОбОшибке,
			П.documentDefectRepairTime);		
		Если ДокументСоздан = Истина Тогда
			Результат.errorMessage = "";
			Результат.isError = Ложь;     

			РегистрыСведений.ТекущийЗаказНаСтанции.СохранитьСостояниеЗаказа(РабочееМесто,Заказ,Ложь);

		Иначе
			Результат.errorMessage = СообщениеОбОшибке;
			Результат.isError = Истина;
		КонецЕсли;    
		
		Ответ.Данные = Результат;       

	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьКонтроль(Запрос, Ответ) Экспорт 
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("РабочееМесто", РабочееМесто);  
	Заказ = Неопределено;
	Запрос.ДополнительныеСвойства.Свойство("Заказ", Заказ);  
	
	П = Новый Структура("documentDefectGUID,documentDefectComment,documentStatus,documentDefectRepairTime");
	ЗаполнитьЗначенияСвойств(П,Запрос.Тело);

	Попытка
		
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));   
		
		ОперацияКачества = Перечисления.ОперацииКачества.Ремонт; 
		ПовторныйРемонт = Истина;
		Если РабочееМесто.ТочкаПроверкиКачества.ТипИнтерфейса = Перечисления.ИнтерфейсыОператоров.Инспектор Тогда
			ОперацияКачества = Перечисления.ОперацииКачества.Контроль;  
			ПовторныйРемонт = Ложь;
		КонецЕсли;
		
		ДокОперацияПоКонтролю = Документы.ОперацияПоКонтролю.СоздатьДокумент();
		ДокОперацияПоКонтролю.Дата					= ТекущаяДата();
		ДокОперацияПоКонтролю.Заказ 					= Заказ;
		ДокОперацияПоКонтролю.Консерн  				= П.documentDefectGUID; 
		ДокОперацияПоКонтролю.ОперацияКачества  	= ОперацияКачества; 
		ДокОперацияПоКонтролю.ПроверкаВыполнена 	= П.documentStatus; 
		ДокОперацияПоКонтролю.Комментарий 			= П.documentDefectComment;
		ДокОперацияПоКонтролю.ПовторныйРемонт	= ПовторныйРемонт;
		ДокОперацияПоКонтролю.ВремяРемонта		= П.documentDefectRepairTime;
		ДокОперацияПоКонтролю.Записать(РежимЗаписиДокумента.Проведение);		

		Результат.errorMessage = "";
		Результат.isError = Ложь;     
		
		Ответ.Данные = Результат;       
	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьВыполнениеЗадачи(Запрос, Ответ) Экспорт 
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("taskId");
	ЗаполнитьЗначенияСвойств(П,Запрос.Тело);

	Попытка
		
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));
		
		//Должен быть Заказ
		//Должен быть Задача
		
		Попытка
			Задача = П.taskId.ПолучитьОбъект();
			Задача.ВыполнитьЗадачу();
			ЗадачаВыполнена = Истина;
		Исключение
			ЗадачаВыполнена = Ложь;		
		КонецПопытки;
		
		Если ЗадачаВыполнена = Истина Тогда
			Результат.errorMessage = 	ОбработатьТекстСообщения("Задача выполнена. ", "Task completed.");
			Результат.isError = Ложь;
		Иначе
			Результат.errorMessage = ОбработатьТекстСообщения("Не удалось выполнить задачу. ", "Task failed.");
			Результат.isError = Истина;
		КонецЕсли;            
		
		Ответ.Данные = Результат;       
	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗавершитьИнспекциюРемонтника(Запрос, Ответ) Экспорт 
	
	Если Ответ.Готов() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("Заказ,РабочееМесто,ТочкаПроверкиКачества"); 
	ЗаполнитьЗначенияСвойств(П,Запрос.ДополнительныеСвойства);    
	
	Если ТипЗнч(П.РабочееМесто) = Тип("СправочникСсылка.РабочиеМестаОператоров") Тогда   
		П.ТочкаПроверкиКачества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(П.РабочееМесто, "ТочкаПроверкиКачества");
	Иначе
		ТекстОтвета = "Не удалось определить ТочкаПроверкиКачества.";
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ТекстОтвета, 500);
		Возврат;	
	КонецЕсли;
	
	Попытка
	
		ТекстСообщения = "";
		
		ЭтоОшибка = Не СоздатьДокументРегистрацияПрохожденияТочекРемонтника(П, ТекстСообщения);	  
		
		Если Не ЭтоОшибка Тогда
			РегистрыСведений.ТекущийЗаказНаСтанции.СохранитьСостояниеЗаказа(П.РабочееМесто,П.Заказ,Истина);
		КонецЕсли;
		
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Worstation_2_0_ОбщиеФункции.ПространствоURI(), "RegisterResponse"));
		Результат.errorMessage = ТекстСообщения;
		Результат.isError = ЭтоОшибка;
		
		Ответ.Данные = Результат;
	
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(".", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		РаботаСHTTPСервисами.ОтправитьСообщениеОбОшибкеВСервис(Ответ, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ВыполняетсяКонтрольВыполненногоРемонта(Заказ,ТочкаПроверкиКачества,СообщениеОДефектах) Экспорт
	
	МассивСтрокДефектов = Новый Массив;
	
	Для Каждого Стр Из КонтролируемыеКонсерныЗаказа(Заказ, ТочкаПроверкиКачества) Цикл   
		СтрокаДефекта = "'" + СокрЛП(Стр.ИнспектируемыйЭлемент) + " ("+СокрЛП(Стр.Дефект)+") "+ "'";
		МассивСтрокДефектов.Добавить(СтрокаДефекта);	
	КонецЦикла;   
	
	СообщениеОДефектах = СтрСоединить(МассивСтрокДефектов,"," + Символы.ПС); 
	
	Возврат (МассивСтрокДефектов.Количество()=0);
	
КонецФункции    

Функция КонтролируемыеКонсерныЗаказа(Заказ, ТочкаПроверкиКачества) Экспорт   
	
	//Функция не работает, если не используется Функциональная опция "КонтрольРемонта"
	ИспользоватьКонтрольРемонта  = Константы.ИспользоватьКонтрольРемонта.Получить();
	Если Не ИспользоватьКонтрольРемонта Тогда
		Т = Новый ТаблицаЗначений;
		Возврат Т;
	КонецЕсли;
	
	ТребуетсяПроверка  = Ложь; // Это ремонтник
	Если  ТочкаПроверкиКачества.ТипИнтерфейса = Перечисления.ИнтерфейсыОператоров.Инспектор Тогда
		ТребуетсяПроверка = Истина;
	КонецЕсли;       
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТочкиПроверкиКачества.ПулИнспектируемыхЭлементовДляКонтроля КАК ПулИнспектируемыхЭлементовДляКонтроля,
	               |	ТочкиПроверкиКачества.ПулИнспектируемыхЭлементовДляКонтроля.ВсеИнспектируемыеЭлементы КАК ВсеИнспектируемыеЭлементы,
	               |	ТочкиПроверкиКачества.ПулИнспектируемыхЭлементовДляКонтроля.ВсеДефекты КАК ВсеДефекты,
	               |	ТочкиПроверкиКачества.АктивироватьВкладкуКонтроль КАК АктивироватьВкладкуКонтроль
	               |ПОМЕСТИТЬ ДанныеТочкиПроверкиКачества
	               |ИЗ
	               |	Справочник.ТочкиПроверкиКачества КАК ТочкиПроверкиКачества
	               |ГДЕ
	               |	ТочкиПроверкиКачества.Ссылка = &ТочкаПроверкиКачества
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрольКонсерновОстатки.Консерн.Дата КАК Дата,
	               |	КонтрольКонсерновОстатки.Консерн КАК Консерн,
	               |	КонтрольКонсерновОстатки.Консерн.ИнспектируемыйЭлемент КАК ИнспектируемыйЭлемент,
	               |	КонтрольКонсерновОстатки.Консерн.Дефект КАК Дефект,
	               |	КонтрольКонсерновОстатки.Консерн.ТипДефекта КАК ТипДефекта,
	               |	КонтрольКонсерновОстатки.Консерн.ПозицияА КАК ПозицияА,
	               |	КонтрольКонсерновОстатки.Консерн.ПозицияB КАК ПозицияB,
	               |	КонтрольКонсерновОстатки.Консерн.ПозицияC КАК ПозицияC,
	               |	КонтрольКонсерновОстатки.Консерн.Комментарий КАК Комментарий,
				   |	КонтрольКонсерновОстатки.Консерн.ИзображениеИнспектируемогоЭлемента КАК ИзображениеИнспектируемогоЭлемента,
				   |	КонтрольКонсерновОстатки.Консерн.ОбластьНаИзображении КАК ОбластьНаИзображении
	               |ИЗ
	               |	РегистрНакопления.КонтрольКонсернов.Остатки(
	               |			,
	               |			Заказ = &Заказ
	               |				И ТребуетсяПроверка = &ТребуетсяПроверка) КАК КонтрольКонсерновОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТочкиПроверкиКачества КАК ДанныеТочкиПроверкиКачества
	               |		ПО (ДанныеТочкиПроверкиКачества.АктивироватьВкладкуКонтроль)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПулыИнспектируемыхЭлементов.ИнспектируемыеЭлементы КАК ИнспектируемыеЭлементы
	               |		ПО (ИнспектируемыеЭлементы.Ссылка = ДанныеТочкиПроверкиКачества.ПулИнспектируемыхЭлементовДляКонтроля)
	               |			И КонтрольКонсерновОстатки.Консерн.ИнспектируемыйЭлемент = ИнспектируемыеЭлементы.ИнспектируемыйЭлемент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПулыИнспектируемыхЭлементов.Дефекты КАК Дефекты
	               |		ПО (Дефекты.Ссылка = ДанныеТочкиПроверкиКачества.ПулИнспектируемыхЭлементовДляКонтроля)
	               |			И КонтрольКонсерновОстатки.Консерн.Дефект = Дефекты.Дефект
	               |ГДЕ
	               |	(ДанныеТочкиПроверкиКачества.ВсеИнспектируемыеЭлементы
	               |			ИЛИ НЕ ИнспектируемыеЭлементы.ИнспектируемыйЭлемент ЕСТЬ NULL)
	               |	И (ДанныеТочкиПроверкиКачества.ВсеДефекты
	               |			ИЛИ НЕ Дефекты.Дефект ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Заказ", Заказ); 
	Запрос.УстановитьПараметр("ТочкаПроверкиКачества", ТочкаПроверкиКачества);  
	Запрос.УстановитьПараметр("ТребуетсяПроверка", ТребуетсяПроверка);

	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПреобразоватьДанныеОперации(ДанныеОперации, Данные)
	
	Данные.Вставить("ИнспектируемыйЭлемент", ДанныеОперации.inspectionItemId);
	Данные.Вставить("Дефект",                				Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.defectId, Справочники.Дефекты));
	Данные.Вставить("ПозицияА",   					Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.positionAId, Справочники.ВариантыПозицииA));
	Данные.Вставить("ПозицияB",	  				Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.positionBId, Справочники.ВариантыПозицииB));
	Данные.Вставить("ПозицияC",					Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.positionCId, Справочники.ВариантыПозицииC));
	Данные.Вставить("ТипДефекта", 					Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.defectTypeId, Справочники.ТипыДефектов));

	//Если Не ЗначениеЗаполнено(ДанныеОперации.concernCostId) Тогда
	//	Данные.Вставить("СтоимостьКонсерна", 0);
	//Иначе
	//	Данные.Вставить("СтоимостьКонсерна", 	 РегистрыСведений.СтоимостиКонсерна.ПолучитьСтоимостьПоУИД(
	//			Новый УникальныйИдентификатор(ДанныеОперации.concernCostId)
	//		)
	//	);  
	//КонецЕсли;
	Данные.Вставить("СтоимостьКонсернаНовый", 	Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.concernCostId, Справочники.СтоимостьКонсернов));
	Данные.Вставить("ОтветственныйЗаДефект", 	Worstation_2_0_ОбщиеФункции.ПолучитьСсылкуПоУИ(ДанныеОперации.responsibleId, Справочники.ОтветственныйЗаДефект));

	Данные.Вставить("Отремонтирован", 		 	ДанныеОперации.isRepairedOnLine);
	Данные.Вставить("Комментарий", 			 	ДанныеОперации.commentary);
	Данные.Вставить("ПроверкаOK", 			 		ДанныеОперации.status = "проверен"); 
	
	СпособОбнаруженияДефектов = Перечисления.СпособОбнаруженияДефектов.static;
	Если ДанныеОперации.Установлено("concernDiscoveryTypeId") Тогда
		Если  ЗначениеЗаполнено(ДанныеОперации.concernDiscoveryTypeId) Тогда
			СпособОбнаруженияДефектов = Перечисления.СпособОбнаруженияДефектов[ДанныеОперации.concernDiscoveryTypeId];
		КонецЕсли;
	КонецЕсли;
	Данные.Вставить("СпособОбнаруженияДефектов", СпособОбнаруженияДефектов);
	
	Данные.Вставить("ИзображениеИнспектируемогоЭлемента", ДанныеОперации.imageId);
	Данные.Вставить("ОбластьНаИзображении", ДанныеОперации.points);
	
	// Валидация строки JSON - области на изображении (список списков чисел).
	// Код в попытке, поэтому текст исключения вернется в ответе.
	Если ЗначениеЗаполнено(ДанныеОперации.points) Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ДанныеОперации.points);
		points = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(points) <> Тип("Массив") Тогда
			ВызватьИсключение "Неверный формат области на изображении.";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЭлемента(ДанныеОперации, РабочееМесто)
	
	ИнспектируемыйЭлемент  = ДанныеОперации.inspectionItemId;
	
	ТочкаПроверкиКачества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "ТочкаПроверкиКачества");
	
	ВариантИспользования = ВариантИспользованияИнспектируемогоЭлемента(ТочкаПроверкиКачества, ИнспектируемыйЭлемент);
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнспектируемыйЭлемент, "Ответственный");
	//Ответственный - нужен для того, чтобы подменить ОтветственныйЗаДефект, если он не заполнен
	
	Данные.Вставить("ТочкаПроверкиКачества", ТочкаПроверкиКачества);
	Данные.Вставить("ВариантИспользованияИнспектируемогоЭлемента", ВариантИспользования);
	
	ПреобразоватьДанныеОперации(ДанныеОперации, Данные);
	
	Возврат Данные;
	
КонецФункции

Функция ВариантИспользованияИнспектируемогоЭлемента(ТочкаПроверкиКачества, ИнспектируемыйЭлемент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТочкиПроверкиКачестваИнспектируемыеЭлементы.ВариантИспользованияИнспектируемогоЭлемента КАК ВариантИспользования
	|ИЗ
	|	Справочник.ТочкиПроверкиКачества.ИнспектируемыеЭлементы КАК ТочкиПроверкиКачестваИнспектируемыеЭлементы
	|ГДЕ
	|	НЕ ТочкиПроверкиКачестваИнспектируемыеЭлементы.Ссылка.ЭтоГруппа
	|	И НЕ ТочкиПроверкиКачестваИнспектируемыеЭлементы.Ссылка.ПометкаУдаления
	|	И ТочкиПроверкиКачестваИнспектируемыеЭлементы.ИнспектируемыйЭлемент = &ИнспектируемыйЭлемент
	|	И ТочкиПроверкиКачестваИнспектируемыеЭлементы.Ссылка = &ТочкаПроверкиКачества");
	Запрос.УстановитьПараметр("ТочкаПроверкиКачества", ТочкаПроверкиКачества);
	Запрос.УстановитьПараметр("ИнспектируемыйЭлемент", ИнспектируемыйЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВариантИспользования = Справочники.ВариантыИспользованияИнспектируемыхЭлементов.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ВариантИспользования = Выборка.ВариантИспользования;
	КонецЕсли;
	
	Возврат ВариантИспользования;
	
КонецФункции

Функция РегистрацияКонсерна(ДанныеОперации, Заказ, ТекстОшибки = "") 
							
	ДокОперацияКачества = Документы.ОперацияПоКачеству.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокОперацияКачества, ДанныеОперации);
	
	ДокОперацияКачества.Дата 				= ТекущаяДатаСеанса();
	ДокОперацияКачества.ОперацияКачества 	= Перечисления.ОперацииКачества.Проверка;
	ДокОперацияКачества.Заказ 				= Заказ;
	
	Ответ = ПровестиОперациюПоКачеству(ДокОперацияКачества, ТекстОшибки);
	
	Возврат Ответ;
	
 КонецФункции
 
Функция ПровестиОперациюПоКачеству(ДокОперацияКачества, ТекстОшибки) 
	 
	 Если  ЗначениеЗаполнено(ДокОперацияКачества.ОтветственныйЗаДефект) И ДокОперацияКачества.ОтветственныйЗаДефект.ЭтоГруппа = Истина Тогда
		 ТекстОшибки = "Документ операция по качеству не создан. ОтветственныйЗаДефект не должен быть группой";
		 Возврат Ложь;
	 КонецЕсли;
	 
	 
	Если ДокОперацияКачества.ОперацияКачества = Перечисления.ОперацииКачества.Ремонт Тогда
		НадоВыполнитьДействияПоЗакрытиюДефекта = Истина;
		ИнспектируемыйЭлемент = ДокОперацияКачества.ДокументКонсерна.ИнспектируемыйЭлемент;
		
	ИначеЕсли ДокОперацияКачества.ОперацияКачества = Перечисления.ОперацииКачества.Проверка и ДокОперацияКачества.Отремонтирован Тогда
		НадоВыполнитьДействияПоЗакрытиюДефекта = Истина;
		ИнспектируемыйЭлемент = ДокОперацияКачества.ВариантИспользованияИнспектируемогоЭлемента.Владелец;
		
	Иначе
		НадоВыполнитьДействияПоЗакрытиюДефекта = Ложь;
	КонецЕсли;     
	
	// теперь подыщем действия по закрытию дефекта
	Если НадоВыполнитьДействияПоЗакрытиюДефекта Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.Ссылка КАК ДействиеПриЗакрытииКонсерна,
		|	ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.Ссылка.ВариантДействия
		|ПОМЕСТИТЬ ПодходящиеДействия
		|ИЗ
		|	Справочник.ДействияПриЗакрытииКонсерна.ИнспектируемыеЭлементы КАК ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы
		|ГДЕ
		|	ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.Ссылка.ДействиеАктивно
		|	И ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.ИнспектируемыйЭлемент = &ИнспектируемыйЭлемент
		|
		|СГРУППИРОВАТЬ ПО
		|	ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.Ссылка,
		|	ДействияПриЗакрытииКонсернаИнспектируемыеЭлементы.Ссылка.ВариантДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодходящиеДействия.ДействиеПриЗакрытииКонсерна,
		|	ПодходящиеДействия.ДействиеПриЗакрытииКонсерна.ОписаниеОбслуживания КАК ОписаниеОбслуживания
		|ИЗ
		|	ПодходящиеДействия КАК ПодходящиеДействия
		|ГДЕ
		|	ПодходящиеДействия.ВариантДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриЗакрытииКонсерна.Обслуживание)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодходящиеДействия.ДействиеПриЗакрытииКонсерна,
		|	ДействияПриЗакрытииКонсернаСбросРегистрацииНаТочках.ТочкаПроверкиКачества
		|ИЗ
		|	ПодходящиеДействия КАК ПодходящиеДействия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДействияПриЗакрытииКонсерна.СбросРегистрацииНаТочках КАК ДействияПриЗакрытииКонсернаСбросРегистрацииНаТочках
		|		ПО ПодходящиеДействия.ДействиеПриЗакрытииКонсерна = ДействияПриЗакрытииКонсернаСбросРегистрацииНаТочках.Ссылка
		|ГДЕ
		|	ПодходящиеДействия.ВариантДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриЗакрытииКонсерна.СбросРегистрации)";
		
		Запрос.УстановитьПараметр("ИнспектируемыйЭлемент", ИнспектируемыйЭлемент);
		
		Результат = Запрос.ВыполнитьПакет();
		
		// действия обслуживания
		ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаОбслуживание = ДокОперацияКачества.Обслуживание.Добавить();
			СтрокаОбслуживание.ДействиеПриЗакрытииКонсерна = ВыборкаДетальныеЗаписи.ДействиеПриЗакрытииКонсерна;
			СтрокаОбслуживание.ОписаниеОбслуживания = ВыборкаДетальныеЗаписи.ОписаниеОбслуживания;
		КонецЦикла;
		
		// сброс регистрации на точках проверки качества
		ВыборкаДетальныеЗаписи = Результат[2].Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаСбросРегистрации = ДокОперацияКачества.СбросРегистрацииНаТочкахПроверкиКачества.Добавить();
			СтрокаСбросРегистрации.ДействиеПриЗакрытииКонсерна = ВыборкаДетальныеЗаписи.ДействиеПриЗакрытииКонсерна;
			СтрокаСбросРегистрации.ТочкаПроверкиКачества = ВыборкаДетальныеЗаписи.ТочкаПроверкиКачества;
		КонецЦикла;
	КонецЕсли; 
	
	НачатьТранзакцию();
	Попытка
		ДокОперацияКачества.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	Исключение          
		Инфо = ИнформацияОбОшибке();
		ТекстОшибки = КраткоеПредставлениеОшибки(Инфо);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НадоВыполнитьДействияПоЗакрытиюДефекта Тогда
		// создадим задачи по обслуживанию
		Для каждого СтрокаОбслуживание Из ДокОперацияКачества.Обслуживание Цикл
			ТекЗадача = Задачи.ОбслуживаниеПриЗакрытииКонсерна.СоздатьЗадачу();
			ТекЗадача.Дата = ТекущаяДата();
			ТекЗадача.Заказ = ДокОперацияКачества.Заказ;
			ТекЗадача.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ТекЗадача.ДокументЗакрытияКонсерна = ДокОперацияКачества.Ссылка;
			ТекЗадача.СработавшееДействие = СтрокаОбслуживание.ДействиеПриЗакрытииКонсерна;
			ТекЗадача.Наименование = СтрокаОбслуживание.ОписаниеОбслуживания;
			Попытка
				ТекЗадача.Записать();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
		КонецЦикла; 
	КонецЕсли;              
	
	//Попытка 
	//	РегистрыСведений.ТекущийЗаказНаСтанции.СохранитьСостояниеЗаказа(???,Заказ,Ложь);
	//Исключение
	//			ТекстОшибки = ОписаниеОшибки();
	//			ОтменитьТранзакцию();
	//			Возврат Ложь;
	//КонецПопытки;
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	 
КонецФункции

Функция ДанныеТочкиПроверкиКачества(ТочкаПроверкиКачества)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТочкиПроверкиКачества.КонтролироватьПрохождениеОбязательныхТочек КАК КонтролироватьПрохождениеОбязательныхТочек,
	|	ТочкиПроверкиКачества.КонтролироватьКомплектность КАК КонтролироватьКомплектность,
	|	ТочкиПроверкиКачества.КонтролироватьНаличиеОткрытыхКонсернов КАК КонтролироватьНаличиеОткрытыхКонсернов,
	|	ТочкиПроверкиКачества.КонтролироватьСледующиеДефекты КАК КонтролироватьСледующиеДефекты,
	|	ТочкиПроверкиКачества.КонтролироватьВыполненныйРемонт КАК КонтролироватьВыполненныйРемонт,
	|	ТочкиПроверкиКачества.ПоказыватьВсеИнспектируемыеЭлементы КАК ПоказыватьВсеИнспектируемыеЭлементы,
	|	ТочкиПроверкиКачества.КонтролируемыеТипыКампании.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ТипКампании КАК ТипКампании
	|	) КАК КонтролируемыеТипыКампании,
	|	ТочкиПроверкиКачества.КонтролироватьНаличиеКампаний КАК КонтролироватьНаличиеКампаний
	|ИЗ
	|	Справочник.ТочкиПроверкиКачества КАК ТочкиПроверкиКачества
	|ГДЕ
	|	ТочкиПроверкиКачества.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ТочкаПроверкиКачества);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = Результат.Выгрузить();
	
	СтруктураДанных = Новый Структура;
	ТекДанные = Данные[0];
	Для Каждого Колонка Из Данные.Колонки Цикл
		СтруктураДанных.Вставить(Колонка.Имя, ТекДанные[Колонка.Имя]);	
	КонецЦикла; 
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ДанныеДляЗавершенияИнспекции(РабочееМесто, Заказ)
	
	ТочкаПроверкиКачества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "ТочкаПроверкиКачества");

	ПоказыватьВсеИнспектируемыеЭлементы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаПроверкиКачества, "ПоказыватьВсеИнспектируемыеЭлементы");
	
	ДанныеОперации = ДанныеТочкиПроверкиКачества(ТочкаПроверкиКачества);
	Если ДанныеОперации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИнспектируемыеЭлементы = Worstation_2_0_ОбщиеФункции.ОпределитьИнспектируемыеЭлементы(ПоказыватьВсеИнспектируемыеЭлементы, ТочкаПроверкиКачества, Заказ);
	
	ДанныеОперации.Вставить("ТочкаПроверкиКачества",  ТочкаПроверкиКачества);
	ДанныеОперации.Вставить("ИнспектируемыеЭлементы", ИнспектируемыеЭлементы);
	ДанныеОперации.Вставить("Заказ", Заказ);
	
	Возврат ДанныеОперации;
	
КонецФункции
 
Функция СоздатьДокументРегистрацияПрохожденияТочекПроверкиКачества(Структура, ИтоговыйТекстСообщения)
	
	//Так как это итоговый документ, который завершает цикл проверки автомобиля, надо выполнить некоторые контроли
	КонтрольПройден = Истина;
	
	//Точно ли у нас есть заказ?
	Если Не ЗначениеЗаполнено(Структура.Заказ) Тогда		
		ИтоговыйТекстСообщения = ОбработатьТекстСообщения("Сначала отсканируйте VIN. ", "Scan VIN to begin work.");
		Возврат Ложь;
	КонецЕсли;
	
	//Контроль: Обязательные инспекционные элементы проверены полностью
	Если Не Структура.ПоказыватьВсеИнспектируемыеЭлементы Тогда
		Разделитель = ОбработатьТекстСообщения("Требуется проинспектировать следующие элементы: " + Символы.ПС, "You need to check these inspection items: " + Символы.ПС);
		ТекстСообщения = "";
		
		Отбор = Новый Структура("ПроверкаОбязательна, Статус", Истина, 0);
		СтрокиОбязательнойИнспекции = Структура.ИнспектируемыеЭлементы.НайтиСТроки(Отбор);
		Для Каждого Элемент Из СтрокиОбязательнойИнспекции Цикл
			ТекстСообщения = ТекстСообщения + Разделитель + Элемент.ИнспектируемыйЭлемент;
			Разделитель = "," + Символы.ПС;
			КонтрольПройден = Ложь;	
		КонецЦикла; 
		
		Если Не КонтрольПройден Тогда
			ИтоговыйТекстСообщения = ИтоговыйТекстСообщения + Символы.ПС + ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
		
	//Контроль: все точки контроля качества
	Разделитель = ОбработатьТекстСообщения("Требуется прохождение следующих точек: ", "You need to pass these stations: ");
	ТекстСообщения = "";
	Если Структура.КонтролироватьПрохождениеОбязательныхТочек Тогда
		КонтрольПрохожденияОбязательныхТочекПройден = QNS.ОбязательныеТочкиПройдены(Структура.Заказ, Структура.ТочкаПроверкиКачества, ТекстСообщения);
		Если Не КонтрольПрохожденияОбязательныхТочекПройден Тогда
			ИтоговыйТекстСообщения = ИтоговыйТекстСообщения + Символы.ПС + Разделитель + ТекстСообщения;	
			КонтрольПройден = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Контроль: выполненного ремонта 
	СообщениеОДефектах = "";     
	Если Структура.ТочкаПроверкиКачества.КонтролироватьВыполненныйРемонт Тогда
		Если Не ВыполняетсяКонтрольВыполненногоРемонта(Структура.Заказ,Структура.ТочкаПроверкиКачества,СообщениеОДефектах) Тогда
			ИтоговыйТекстСообщения= "Необходимо выполнить контроль: "+Символы.ПС+СообщениеОДефектах;
			Возврат Ложь;
		КонецЕсли;      
	КонецЕсли;
                   
	
	//Контроль: Требуется устранить некомплекты
	Разделитель = ОбработатьТекстСообщения("Требуется устранить следующие некомплекты: ", "You need to set these shortages: ");
	ТекстСообщения = "";
	Если Структура.КонтролироватьКомплектность Тогда
		КонтрольНекомплектовПройден = QNS.КонтрольКомплектности(Структура.Заказ, ТекстСообщения);
		Если Не КонтрольНекомплектовПройден Тогда
			ИтоговыйТекстСообщения = ИтоговыйТекстСообщения + Символы.ПС + Разделитель + ТекстСообщения;	
			КонтрольПройден = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ДвижениеЗарегистрировано = Ложь;
	ИтоговыйТекстСообщения = СокрЛП(ИтоговыйТекстСообщения);
	Если КонтрольПройден Тогда
		ДвижениеЗарегистрировано = QNS.РегистрацияПрохожденияТочкиПроверкиКачества(Структура.Заказ, Структура.ТочкаПроверкиКачества);	
		Если ДвижениеЗарегистрировано Тогда
		 	ИтоговыйТекстСообщения = ОбработатьТекстСообщения("Инспекция автомобиля " + Структура.Заказ + " выполнена.", "Vehicle inspection completed. ");
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат ДвижениеЗарегистрировано;
	
КонецФункции

Функция СоздатьДокументРегистрацияПрохожденияТочекРемонтника(Структура, ИтоговыйТекстСообщения)
	
	//Так как это итоговый документ, который завершает цикл проверки автомобиля, надо выполнить некоторые контроли
	ИтоговыйТекстСообщения = "";	
	КонтрольПройден = Истина;
	
	//Точно ли у нас есть заказ?
	Если Не ЗначениеЗаполнено(Структура.Заказ) Тогда		
		ИтоговыйТекстСообщения= ОбработатьТекстСообщения("Сначала отсканируйте VIN. ", "Scan VIN to begin work. ");
		Возврат Ложь;
	КонецЕсли;
	
	////Контроль выполненного ремонта 
	//СообщениеОДефектах = "";
	//Если Не ВыполняетсяКонтрольВыполненногоРемонта(Структура.Заказ,Структура.ТочкаПроверкиКачества,СообщениеОДефектах) Тогда
	//	ИтоговыйТекстСообщения= "Требуется выполнить контроль ремонта: "+СообщениеОДефектах;
	//	Возврат Ложь;
	//КонецЕсли;
	
	//Создание документа регистрации движения 
	ДвижениеЗарегистрировано = Ложь;
	Если КонтрольПройден Тогда
		ДвижениеЗарегистрировано = QNS.РегистрацияПрохожденияТочкиПроверкиКачества(Структура.Заказ, Структура.ТочкаПроверкиКачества);	
		Если ДвижениеЗарегистрировано Тогда
		 	ИтоговыйТекстСообщения = ОбработатьТекстСообщения("Ремонт автомобиля "+Структура.Заказ+" выполнен.", "Vehicle repair completed. ");
		КонецЕсли;
	КонецЕсли;
		
	Возврат ДвижениеЗарегистрировано;
	
КонецФункции

#КонецОбласти
